{
  "type": "ImageView",
  "description": "A widget to display an image.",
  "extends": "Widget",
  "properties": {
    "image": {
      "type": "Image",
      "description": "The image to display. Providing the `width` and `height` attributes on the image will resize it internally. When no dimensions are given the image will be loaded with its original size. Since the full size image might occupy a lot of memory, it's recommended to provide exact dimensions."
    },
    "scaleMode": {
      "type": "string",
      "values": [
        "auto",
        "fit",
        "fill",
        "stretch",
        "none"
      ],
      "default": "auto",
      "description": "How to scale the image.\n\n- `fit` will scale the image proportionally to fit into the view, possible leaving some empty space at the edges. That is, the image will be displayed as large as possible while being fully contained in the view.\n- `fill` will scale the image proportionally to fill the entire view, possibly cutting off parts of the image. That is, the image will be displayed as small as possible while covering the entire view.\n- `auto` will scale *down* the image to *fit* into the view if it is too large, but it won't scale up a smaller image.\n- `stretch` will resize the image to the actual bounds of the image view.\n- `none` will not resize the image at all. The image will be displayed in its original size."
    },
    "tintColor": {
      "type": "Color",
      "description": "A color to change the image appearance. All opaque parts of the image will be tinted with the given color. Set to `initial` to remove the effect. Available on iOS and Android 5.0+."
    }
  },
  "events": {
    "load": {
      "description": "Fired when the image loading has finished.",
      "parameters": {
        "error": {
          "description": "Contains the final status of the loading process",
          "type": "boolean"
        }
      }
    }
  },
  "links": [
    {
      "title": "Image example",
      "path": "${GITHUB_BRANCH}/examples/image/image.js"
    }
  ]
}
