{
  "type": "FileSystem",
  "object": "fs",
  "extends": "NativeObject",
  "description": "The `fs` object provides methods to read and write files. All methods are asynchronous and return a promise.",
  "constructor": {
    "access": "private"
  },
  "properties": {
    "filesDir": {
      "type": "string",
      "readonly": true,
      "static": true,
      "description": "The path of a directory that the app may use to store persistent files."
    },
    "cacheDir": {
      "type": "string",
      "readonly": true,
      "static": true,
      "description": "The path of a directory that the app may use to store cached files. The OS may delete files in this directory when the device runs low on storage. Only use this location for data that can easily be re-created."
    }
  },
  "methods": {
    "readFile": [
      {
        "parameters": [
          {
            "name": "path",
            "type": "string",
            "description": "The path of the file to read."
          }
        ],
        "returns": "Promise<ArrayBuffer>",
        "description": "Reads the given file and returns a promise that resolves to the contents of the file on success and rejects with an Error in case of a failure. The file contents are returned as an ArrayBuffer."
      },
      {
        "parameters": [
          {
            "name": "path",
            "type": "string",
            "description": "The path of the file to read."
          },
          {
            "name": "encoding",
            "type": "string",
            "description": "The encoding to use to read text files."
          }
        ],
        "returns": "Promise<string>",
        "description": "Reads the given text file and returns a promise that resolves to the contents of the file on success and rejects with an Error in case of a failure. The file contents are returned as a string."
      }
    ],
    "readDir": {
      "parameters": [
        {
          "name": "path",
          "type": "string",
          "description": "The path of the directory to read."
        }
      ],
      "returns": "Promise<string[]>",
      "description": "Reads the contents of a given directory. Returns a promise that resolves on success to an array of the names of the files in the directory excluding '.' and '..'. In case of failure, the Promise rejects with an Error."
    },
    "writeFile": [
      {
        "parameters": [
          {
            "name": "path",
            "type": "string",
            "description": "The path of the file to write."
          },
          {
            "name": "data",
            "type": "ArrayBuffer",
            "description": "The contents to write to the file."
          }
        ],
        "returns": "Promise<void>",
        "description": "Writes the given binary contents to the given file. If the file exists, it is overwritten, otherwise it is created. Returns a promise that resolves on success and rejects with an Error in case of a failure."
      },
      {
        "parameters": [
          {
            "name": "path",
            "type": "string",
            "description": "The path of the file to write."
          },
          {
            "name": "text",
            "type": "string",
            "description": "The text to write to the file."
          },
          {
            "name": "encoding",
            "type": "string",
            "optional": true,
            "description": "The encoding to use to write a text file. When omitted, `utf-8` will be used."
          }
        ],
        "returns": "Promise<void>",
        "description": "Writes the given text to the given file using the given encoding or `utf-8` if no encoding is specified. If the file exists, it is overwritten, otherwise it is created. Returns a promise that resolves on success and rejects with an Error in case of a failure."
      }
    ],
    "removeFile": {
      "parameters": [
        {
          "name": "path",
          "type": "string",
          "description": "The path of the file to remove."
        }
      ],
      "returns": "Promise<void>",
      "description": "Removes the given file. Returns a promise that resolves on success and rejects with an Error in case of a failure."
    }
  }
}
